In [3]:
import pandas as pd
import seaborn as sns

In [19]:
avo_df = pd.read_csv('avocado.csv', usecols = ['Date', 'AveragePrice', 'year', 'region'])

avo_df.head()

         Date  AveragePrice  year  region
0  2015-12-27          1.33  2015  Albany
1  2015-12-20          1.35  2015  Albany
2  2015-12-13          0.93  2015  Albany
3  2015-12-06          1.08  2015  Albany
4  2015-11-29          1.28  2015  Albany

In [21]:
avo_df = avo_df.loc[avo_df.region == 'Atlanta']

avo_df.head()

          Date  AveragePrice  year   region
52  2015-12-27          0.99  2015  Atlanta
53  2015-12-20          1.08  2015  Atlanta
54  2015-12-13          0.96  2015  Atlanta
55  2015-12-06          1.07  2015  Atlanta
56  2015-11-29          0.99  2015  Atlanta

In [22]:
avo_df.tail()

             Date  AveragePrice  year   region
17620  2018-02-04          1.62  2018  Atlanta
17621  2018-01-28          1.67  2018  Atlanta
17622  2018-01-21          1.64  2018  Atlanta
17623  2018-01-14          1.56  2018  Atlanta
17624  2018-01-07          1.53  2018  Atlanta

In [86]:
df_15 = pd.read_csv('2015-atlanta-census.csv', header=0, names=['group', '2015'])
df_16 = pd.read_csv('2016-atlanta-census.csv', header=0, names=['group', '2016'])
df_17 = pd.read_csv('2017-atlanta-census.csv', header=0, names=['group', '2017'])
df_18 = pd.read_csv('2018-atlanta-census.csv', header=0, names=['group', '2018'])

df_16

                                                group     2016
0                                              Total:  472,506
1                             Not Hispanic or Latino:  449,408
2                                         White alone  178,077
3                     Black or African American alone  237,590
4             American Indian and Alaska Native alone      951
5                                         Asian alone   20,253
6           Native Hawaiian and Other Pacific Isla...      170
7                               Some other race alone      481
8                                  Two or more races:   11,886
9                 Two races including Some other race    1,236
10              Two races excluding Some other rac...   10,650
11                                Hispanic or Latino:   23,098
12                                        White alone   12,815
13                    Black or African American alone    2,612
14            American Indian and Alaska Native alone    1,944
15                                        Asian alone      197
16          Native Hawaiian and Other Pacific Isla...       39
17                              Some other race alone    3,482
18                                 Two or more races:    2,009
19                Two races including Some other race      578
20              Two races excluding Some other rac...    1,431

In [94]:
cens_df = pd.merge(df_15, df_16['2016'], left_index=True, right_index=True, how = 'left')
cens_df = pd.merge(cens_df, df_17['2017'], left_index=True, right_index=True, how = 'left')
cens_df = pd.merge(cens_df, df_18['2018'], left_index=True, right_index=True, how = 'left')

cens_df

,group,2015,2016,2017,2018
0,Total:,"463,875","472,506","486,299","498,073"
1,Not Hispanic or Latino:,"445,222","449,408","465,421","475,094"
2,White alone,"176,998","178,077","179,296","189,230"
3,Black or African American alone,"239,159","237,590","253,556","252,493"
4,American Indian and Alaska Native alone,652,951,374,495
5,Asian alone,"20,335","20,253","19,551","19,875"
6,Native Hawaiian and Other Pacific Isla...,147,170,0,142
7,Some other race alone,265,481,"2,129","1,324"
8,Two or more races:,"7,666","11,886","10,515","11,535"
9,Two races including Some other race,405,"1,236",144,471
10,Two races excluding Some other rac...,"7,261","10,650","10,371","11,064"
11,Hispanic or Latino:,"18,653","23,098","20,878","22,979"
12,White alone,"12,155","12,815","11,119","14,285"
13,Black or African American alone,"1,440","2,612","3,332","1,277"
14,American Indian and Alaska Native alone,651,"1,944",330,323
15,Asian alone,81,197,0,144
16,Native Hawaiian and Other Pacific Isla...,316,39,0,0
17,Some other race alone,"2,282","3,482","4,409","5,214"
18,Two or more races:,"1,728","2,009","1,688","1,736"
19,Two races including Some other race,529,578,766,571
20,Two races excluding Some other rac...,"1,199","1,431",922,"1,165"

In [98]:
cens_df.to_excel(excel_writer= 'atlanta-census.xlsx' , sheet_name='2015-2018')